## Pandas
Learning basics of pandas from pandas website [10 minutes to pandas](https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html).

### Import essentials:
Import **NumPy** and **Pandas**.

In [1]:
### Import numpy and pandas 
import numpy as np
import pandas as pd

### Object creation

In [2]:
# Create a series by passing the list of values 
A = pd.Series([1,2,3,4,np.nan,5,6,7])

#Display the results
A

0    1.0
1    2.0
2    3.0
3    4.0
4    NaN
5    5.0
6    6.0
7    7.0
dtype: float64

In [3]:
# Create a dataframe by passing NumPy array with date time indexing using data_range() and labelled column
dates = pd.date_range("20130101", periods = 6)
dates

df = pd.DataFrame(np.random.randn(6,4), index= dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01  0.071389  0.007500  0.155793  0.678333
2013-01-02 -1.394066  0.189310  0.365064  0.524033
2013-01-03  0.201639  0.227478 -0.771621  0.167946
2013-01-04 -0.084451  0.067631  0.503081 -0.584886
2013-01-05  0.928780  0.711642  0.922892 -0.697446
2013-01-06  0.361195 -0.899091 -1.210832 -0.322670

Create a data frame by passing a dictionary of objects that can be converted into a series-like structure.

In [4]:
df2 = pd.DataFrame({
    "A":1.0,
    "B":pd.Timestamp("20130101"),
    "C":pd.Series(1, index=list(range(4)), dtype= "float32"),
    "D":np.array([3] *4, dtype= "int32"),
    "E":pd.Categorical(["test", "train", "test", "train"]),
    "F":"foo"
})

df2

     A          B    C  D      E    F
0  1.0 2013-01-01  1.0  3   test  foo
1  1.0 2013-01-01  1.0  3  train  foo
2  1.0 2013-01-01  1.0  3   test  foo
3  1.0 2013-01-01  1.0  3  train  foo

Know the different datatypes in the data frame

In [5]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

Viewing data

In [6]:
df.head() #for the top rows

                   A         B         C         D
2013-01-01  0.071389  0.007500  0.155793  0.678333
2013-01-02 -1.394066  0.189310  0.365064  0.524033
2013-01-03  0.201639  0.227478 -0.771621  0.167946
2013-01-04 -0.084451  0.067631  0.503081 -0.584886
2013-01-05  0.928780  0.711642  0.922892 -0.697446

In [7]:
df.tail(3) #bottom 3 rows

                   A         B         C         D
2013-01-04 -0.084451  0.067631  0.503081 -0.584886
2013-01-05  0.928780  0.711642  0.922892 -0.697446
2013-01-06  0.361195 -0.899091 -1.210832 -0.322670

DataFrame.to_numpy() gives NumPy representation of the underlying data.
**NumPy**: *NumPy arrays have one data type for the entire array, while 
pandas DataFrame have one data type per column*.

In [8]:
df.to_numpy()

array([[ 0.07138912,  0.0075004 ,  0.15579331,  0.67833345],
       [-1.39406575,  0.18930986,  0.3650638 ,  0.52403346],
       [ 0.20163935,  0.22747781, -0.77162131,  0.16794568],
       [-0.08445058,  0.06763127,  0.50308064, -0.58488619],
       [ 0.92878018,  0.71164203,  0.92289245, -0.69744641],
       [ 0.36119497, -0.89909083, -1.2108322 , -0.3226704 ]])

In [9]:
# Summary statistics
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.014081  0.050745 -0.005937 -0.039115
std    0.773073  0.527553  0.815312  0.580760
min   -1.394066 -0.899091 -1.210832 -0.697446
25%   -0.045491  0.022533 -0.539768 -0.519332
50%    0.136514  0.128471  0.260429 -0.077362
75%    0.321306  0.217936  0.468576  0.435012
max    0.928780  0.711642  0.922892  0.678333

In [10]:
# transposing the data 
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.071389   -1.394066    0.201639   -0.084451    0.928780    0.361195
B    0.007500    0.189310    0.227478    0.067631    0.711642   -0.899091
C    0.155793    0.365064   -0.771621    0.503081    0.922892   -1.210832
D    0.678333    0.524033    0.167946   -0.584886   -0.697446   -0.322670

In [11]:
# Sort the data frame by axis
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.678333  0.155793  0.007500  0.071389
2013-01-02  0.524033  0.365064  0.189310 -1.394066
2013-01-03  0.167946 -0.771621  0.227478  0.201639
2013-01-04 -0.584886  0.503081  0.067631 -0.084451
2013-01-05 -0.697446  0.922892  0.711642  0.928780
2013-01-06 -0.322670 -1.210832 -0.899091  0.361195

In [12]:
# sort by values
df.sort_values(by ="B")

                   A         B         C         D
2013-01-06  0.361195 -0.899091 -1.210832 -0.322670
2013-01-01  0.071389  0.007500  0.155793  0.678333
2013-01-04 -0.084451  0.067631  0.503081 -0.584886
2013-01-02 -1.394066  0.189310  0.365064  0.524033
2013-01-03  0.201639  0.227478 -0.771621  0.167946
2013-01-05  0.928780  0.711642  0.922892 -0.697446

### Selection

In [13]:
#Selecting a single column
df["A"]

2013-01-01    0.071389
2013-01-02   -1.394066
2013-01-03    0.201639
2013-01-04   -0.084451
2013-01-05    0.928780
2013-01-06    0.361195
Freq: D, Name: A, dtype: float64

In [14]:
#Selecting via [] (_getitem_), which slices rows
df[0:3]

                   A         B         C         D
2013-01-01  0.071389  0.007500  0.155793  0.678333
2013-01-02 -1.394066  0.189310  0.365064  0.524033
2013-01-03  0.201639  0.227478 -0.771621  0.167946

In [17]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02 -1.394066  0.189310  0.365064  0.524033
2013-01-03  0.201639  0.227478 -0.771621  0.167946
2013-01-04 -0.084451  0.067631  0.503081 -0.584886

In [18]:
# selecting by label
df.loc[dates[0]]

A    0.071389
B    0.007500
C    0.155793
D    0.678333
Name: 2013-01-01 00:00:00, dtype: float64

In [19]:
# selecting multiple-axis by label
df.loc[:,["A", "B"]]

                   A         B
2013-01-01  0.071389  0.007500
2013-01-02 -1.394066  0.189310
2013-01-03  0.201639  0.227478
2013-01-04 -0.084451  0.067631
2013-01-05  0.928780  0.711642
2013-01-06  0.361195 -0.899091

In [20]:
# Showing label slicing both endpoints are included
df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02 -1.394066  0.189310
2013-01-03  0.201639  0.227478
2013-01-04 -0.084451  0.067631

In [21]:
# Reduction in the dimension of the returned object
df.loc["20130102", ["A", "B"]]

A   -1.394066
B    0.189310
Name: 2013-01-02 00:00:00, dtype: float64

In [22]:
#For getting scalar value
df.loc[dates[0], "A"]

0.07138912357726222

In [23]:
df.at[dates[0], "A"]

0.07138912357726222

**Selection by position**
*Using DataFrame.iloc()  or DataFrame.at()*

In [24]:
df.iloc[3]

A   -0.084451
B    0.067631
C    0.503081
D   -0.584886
Name: 2013-01-04 00:00:00, dtype: float64

In [25]:
#integer slice 
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.084451  0.067631
2013-01-05  0.928780  0.711642

In [26]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -1.394066  0.365064
2013-01-03  0.201639 -0.771621
2013-01-05  0.928780  0.922892

In [27]:
#Slicing rows explicitly
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02 -1.394066  0.189310  0.365064  0.524033
2013-01-03  0.201639  0.227478 -0.771621  0.167946

In [28]:
#sclicing columns explicitly 
df.iloc[:,1:3]

                   B         C
2013-01-01  0.007500  0.155793
2013-01-02  0.189310  0.365064
2013-01-03  0.227478 -0.771621
2013-01-04  0.067631  0.503081
2013-01-05  0.711642  0.922892
2013-01-06 -0.899091 -1.210832

In [29]:
#for getting explicit value 
df.iloc[1,1]

0.1893098581392545

In [30]:
# for getting fast access to a scalar (equivalent to previous method)
df.iat[1,1]

0.1893098581392545

###  Boolean indexing

Using a single column's value to select data

In [32]:
df[df["A"]>0]

                   A         B         C         D
2013-01-01  0.071389  0.007500  0.155793  0.678333
2013-01-03  0.201639  0.227478 -0.771621  0.167946
2013-01-05  0.928780  0.711642  0.922892 -0.697446
2013-01-06  0.361195 -0.899091 -1.210832 -0.322670

In [33]:
#selecting values from a DataFrame where a boolean condition is met
df[df>0]

                   A         B         C         D
2013-01-01  0.071389  0.007500  0.155793  0.678333
2013-01-02       NaN  0.189310  0.365064  0.524033
2013-01-03  0.201639  0.227478       NaN  0.167946
2013-01-04       NaN  0.067631  0.503081       NaN
2013-01-05  0.928780  0.711642  0.922892       NaN
2013-01-06  0.361195       NaN       NaN       NaN

Use ***isin()*** method for filtering

In [35]:
df2= df.copy()
df2["E"] = ["one", "one", "two", "three", "four", "three"]
df2

                   A         B         C         D      E
2013-01-01  0.071389  0.007500  0.155793  0.678333    one
2013-01-02 -1.394066  0.189310  0.365064  0.524033    one
2013-01-03  0.201639  0.227478 -0.771621  0.167946    two
2013-01-04 -0.084451  0.067631  0.503081 -0.584886  three
2013-01-05  0.928780  0.711642  0.922892 -0.697446   four
2013-01-06  0.361195 -0.899091 -1.210832 -0.322670  three

In [36]:
df2[df2["E"].isin(["two", "four"])]

                   A         B         C         D     E
2013-01-03  0.201639  0.227478 -0.771621  0.167946   two
2013-01-05  0.928780  0.711642  0.922892 -0.697446  four